; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v11)
             (pred_6 ?v8 ?v10)
             (pred_8 ?v5 ?v10)
             (pred_10 ?v9 ?v5 )
	     (pred_1 ?v5)
             (pred_2 ?v2)
             (pred_12 ?v8)
             (pred_4 ?v10)
             (pred_3 ?v5)
             (pred_11 ?v8)
             (pred_5 ?v5)
             (pred_9 ))



(:action op_3
:parameters (?v12 ?v1 ?v3 ?v7)
:precondition (and (pred_2 ?v12) (pred_2 ?v1) (pred_12 ?v3) (pred_4 ?v7)
          (pred_7 ?v12 ?v1) (pred_6 ?v3 ?v7)
                   (pred_8 ?v1 ?v7) (pred_1 ?v12) 
                   (pred_3 ?v1) (pred_11 ?v3))
:effect (and  (pred_5 ?v1) (not (pred_3 ?v1))))


(:action op_1
:parameters (?v12 ?v6)
:precondition (and (pred_2 ?v12) (pred_2 ?v6)
               (pred_1 ?v12) (pred_7 ?v12 ?v6) (pred_5 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v12))))

(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_2 ?v12) (pred_12 ?v3) 
                  (pred_1 ?v12) (pred_10 ?v3 ?v12) (pred_9 ))
:effect (and (pred_11 ?v3)
   (not (pred_10 ?v3 ?v12)) (not (pred_9 ))))


(:action op_4
:parameters (?v12 ?v4 ?v13)
:precondition (and (pred_2 ?v12) (pred_12 ?v4) (pred_12 ?v13)
                  (pred_1 ?v12) (pred_11 ?v13) (pred_10 ?v4 ?v12))
:effect (and (pred_11 ?v4) (pred_10 ?v13 ?v12)
        (not (pred_11 ?v13)) (not (pred_10 ?v4 ?v12))))

(:action op_5
:parameters (?v12 ?v3)
:precondition (and (pred_2 ?v12) (pred_12 ?v3) 
                  (pred_1 ?v12) (pred_11 ?v3))
:effect (and (pred_9 ) (pred_10 ?v3 ?v12) (not (pred_11 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_22 obj_23 obj_04 obj_05 obj_12 obj_27 obj_07 obj_02 obj_26 obj_18 obj_21 obj_01 obj_16 obj_25 obj_19 obj_03 obj_17 obj_29 obj_13 obj_15 obj_20 obj_10 obj_30 obj_28
    obj_24 obj_06
    obj_09 obj_11 obj_14
    )

    (:init
       (pred_9)

       (pred_2 obj_08)
       (pred_2 obj_22)
       (pred_2 obj_23)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_27)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_26)
       (pred_2 obj_18)
       (pred_2 obj_21)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_25)
       (pred_2 obj_19)
       (pred_2 obj_03)
       (pred_2 obj_17)
       (pred_2 obj_29)
       (pred_2 obj_13)
       (pred_2 obj_15)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_30)
       (pred_2 obj_28)
       (pred_4 obj_24)
       (pred_4 obj_06)
       (pred_12 obj_09)
       (pred_12 obj_11)
       (pred_12 obj_14)

       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_22 obj_27)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_23 obj_07)
       (pred_7 obj_23 obj_04)
       (pred_7 obj_23 obj_22)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_04 obj_23)
       (pred_7 obj_05 obj_26)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_12 obj_27)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_27 obj_21)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_27 obj_22)
       (pred_7 obj_27 obj_12)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_23)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_26)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_26 obj_25)
       (pred_7 obj_26 obj_05)
       (pred_7 obj_26 obj_02)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_21)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_21 obj_03)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_21 obj_27)
       (pred_7 obj_21 obj_18)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_16 obj_29)
       (pred_7 obj_16 obj_25)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_25 obj_13)
       (pred_7 obj_25 obj_26)
       (pred_7 obj_25 obj_16)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_21)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_29)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_29 obj_30)
       (pred_7 obj_29 obj_13)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_29 obj_17)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_13 obj_25)
       (pred_7 obj_13 obj_29)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_10 obj_30)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_30 obj_28)
       (pred_7 obj_30 obj_29)
       (pred_7 obj_30 obj_10)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_28 obj_30)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_8  obj_01 obj_24)
       (pred_8  obj_21 obj_06)
       (pred_8  obj_07 obj_06)
       (pred_5 obj_08)
       (pred_5 obj_22)
       (pred_5 obj_23)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_27)
       (pred_5 obj_02)
       (pred_5 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_25)
       (pred_5 obj_19)
       (pred_5 obj_03)
       (pred_5 obj_17)
       (pred_5 obj_29)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_10)
       (pred_5 obj_30)
       (pred_5 obj_28)

       (pred_6  obj_09 obj_24)
       (pred_6  obj_11 obj_06)
       (pred_6  obj_14 obj_24)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_11 obj_22)
       (pred_10 obj_14 obj_17)
       (pred_1 obj_26)
    )

    (:goal (and
       (pred_10 obj_14 obj_02)
    ))
(:constraints
  (always (not (pred_1 obj_29)))
)
)

; plan
1. (op_1 obj_26 obj_25)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_25)
   goals met: 0 of 1
2. (op_1 obj_25 obj_13)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_28)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_28)
   goals met: 0 of 1
4. (op_1 obj_28 obj_30)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_30)
   goals met: 0 of 1
5. (op_1 obj_30 obj_10)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_17)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_17)
   goals met: 0 of 1
7. (op_2 obj_17 obj_14)
   deleted: (pred_10 obj_14 obj_17) (pred_9)
   added: (pred_11 obj_14)
   goals met: 0 of 1
8. (op_3 obj_17 obj_01 obj_14 obj_24)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01)
   goals met: 0 of 1
9. (op_1 obj_17 obj_01)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_01)
   goals met: 0 of 1
10. (op_1 obj_01 obj_16)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_16)
   goals met: 0 of 1
11. (op_1 obj_16 obj_02)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_02)
   goals met: 0 of 1
12. (op_5 obj_02 obj_14)
   deleted: (pred_11 obj_14)
   added: (pred_9) (pred_10 obj_14 obj_02)
   goals met: 1 of 1
